Repository: anbe42/tmp-geda-gaf
Catalog: libgeda/po/*.po
Languages: ru

source: gEDA circuit schematic
ru: gEDA схема электрическая

source: gEDA schematic symbol
ru: gEDA символ электрический

source: gEDA gsch2pcb project
ru: gEDA проект gsch2pcb

source: gEDA Gsch2pcb Project
ru: gEDA gsch2pcb проект

source: gEDA Circuit Schematic
ru: gEDA электрическая схема

source: gEDA Schematic Symbol
ru: gEDA электрический символ

source: o_save_objects: object %p has unknown type '%c'
ru: o_save_objects: объект %p неизвестного типа '%c'

source: o_save: Could not open [%s]
ru: o_save: невозможно открыть [%s]

source: Read unexpected embedded symbol start marker in [%s] : >> %s<<
ru: Прочитан неожиданный встроенный символ начального маркера в [%s] : >> %s<<

source: Read unexpected embedded symbol end marker in [%s] : >> %s<<
ru: Прочитан неожиданный встроенный символ конечного маркера в [%s] : >> %s<<

source: Read an old format sym/sch file! Please run g[sym|sch]update on: [%s]
ru: Прочитан файл старого формата символа или схемы! Выполните g[sym|sch]update для: [%s]

source: Read garbage in [%s] : >> %s<<
ru: Прочитан мусор в [%s]: >> %s<<

source: Failed to stat [%s]: %s
ru: Ошибка чтения статуса [%s]: %s

source: Cannot find file %s: %s
ru: Невозможно найти файл %s: %s

source: WARNING: Found an autosave backup file: %s.
ru: ВНИМАНИЕ: обнаружен файл автоматической резервной копии: %s.

source: I could not guess if it is newer, so you have to do it manually.
ru: Невозможно предположить новее ли он, выберите самостоятельно.

source: The backup copy is newer than the schematic, so it seems you should load it instead of the original file.
ru: Резервная копия новее схемы, поэтому, видимо, следует загрузить её вместо оригинального файла.

source: Gschem usually makes backup copies automatically, and this situation happens when it crashed or it was forced to exit abruptly.
ru: Обычно Gschem автоматически создаёт резервные копии и эта ситуация случается при крушении Gschem или внезапном завершении.

source: Run gschem and correct the situation.
ru: Запустите gschem и исправьте проблему.

source: Can't get the real filename of %s.
ru: Невозможно получить реальное имя файла для %s.

source: Could NOT set previous backup file [%s] read-write
ru: Невозможно установить режим чтения-записи для предыдущей резервной копии файла [%s]

source: Can't save backup file: %s.
ru: Невозможно сохранить резервную копию файла: %s.

source: Could NOT set backup file [%s] readonly
ru: Невозможно установить режим только для чтения резервной копии файла [%s]

source: Unable to get time of day in f_print_header()
ru: Невозможно получить время в f_print_header()

source: Unable to open the prolog file `%s' for reading in f_print_header()
ru: Невозможно открыть для чтения файл пролога `%s' в f_print_header()

source: Error during reading of the prolog file `%s' in f_print_header()
ru: Ошибка при чтении файла пролога `%s' в f_print_header()

source: Error during writing of the output postscript file in f_print_header()
ru: Ошибка записи postscript-файла в f_print_header()

source: Giving up on printing
ru: Прекращение попытки печати

source: Could not open [%s] for printing
ru: Невозможно открыть [%s] для печати

source: Could not execute command [%s] for printing
ru: Невозможно выполнить команду [%s] для печати

source: Too many UTF-8 characters, cannot print
ru: Слишком много символов UTF-8, невозможно печатать

source: Unknown file: %s
ru: Неизвестный файл: %s

source: Evaluation failed: %s
ru: Оценка не выполнена: %s

source: Enable debugging for more detailed information
ru: Включите отладку для более детальной информации

source: Could not find [%s] for interpretation
ru: Невозможно найти [%s] для интерпретации

source: RC file [%s] already read in.
ru: RC-файл [%s] уже прочитан.

source: Read system config file [%%s]
ru: Чтение файла системной конфигурации [%%s]

source: Did not find required system config file [%%s]
ru: Не найден обязательный файл системной конфигурации [%%s]

source: Read user config file [%%s]
ru: Чтение файла пользовательской конфигурации [%%s]

source: Did not find optional user config file [%%s]
ru: Не найден необязательный файл пользовательской конфигурации [%%s]

source: Read local config file [%%s]
ru: Чтение локального файла конфигурации [%%s]

source: Did not find optional local config file [%%s]
ru: Не найден необязательный файл локальной конфигурации [%%s]

source: Read specified %s file [%%s]
ru: Чтение указанного файла %s [%%s]

source: Did not find specified %s file [%%s]
ru: Не найден указанный файл %s [%%s]

source: Could not find any %s file!
ru: Невозможно найти какой-либо файл %s!

source: WARNING: using a string for 'always-promote-attributes' is deprecated. Use a list of strings instead
ru: ВНИМАНИЕ: использование строки для 'always-promote-attributes' устарело. Вместо этого используйте список из строк

source: Found a zero radius arc [ %c %d, %d, %d, %d, %d, %d ]
ru: Найдена дуга нулевого радиуса [ %c %d, %d, %d, %d, %d, %d ]

source: Found an invalid color [ %s ]
ru: Найден неверный цвет [ %s ]

source: Setting color to default color
ru: Установка цвета по умолчанию

source: Attempt to attach non text item as an attribute!
ru: Попытка присоединить не текстовый элемент как атрибут!

source: Attempt to attach attribute [%s] to more than one object
ru: Попытка присоединить атрибут [%s] к более чем одному объекту

source: Invalid space specified, setting to 100
ru: Указан неверный промежуток, установка 100

source: Invalid length specified, setting to 100
ru: Указана неверная длина, установка 100

source: Found a zero width/height box [ %c %d %d %d %d %d ]
ru: Найден прямоугольник нулевой ширины/высоты [ %c %d %d %d %d %d ]

source: Found a zero length bus [ %c %d %d %d %d %d ]
ru: Найдена шина нулевой длины [ %c %d %d %d %d %d ]

source: Found an invalid bus ripper direction [ %s ]
ru: Найден разрыв шины неверного направления [ %s ]

source: Resetting direction to neutral (no direction)
ru: Сброс направления в нейтральное (без направления)

source: Null radius circles are not allowed
ru: Не допустимы окружности нулевого радиуса

source: Found a zero radius circle [ %c %d %d %d %d ]
ru: Найдена окружность нулевого радиуса [ %c %d %d %d %d ]

source: Component not found: %s
ru: Компонент не найден: %s

source: Found a component with an invalid rotation [ %c %d %d %d %d %d %s ]
ru: Найден компонент с неверным поворотом [ %c %d %d %d %d %d %s ]

source: Found a component with an invalid mirror flag [ %c %d %d %d %d %d %s ]
ru: Найден компонент с неверным флагом зеркалирования [ %c %d %d %d %d %d %s ]

source: WARNING: Symbol version parse error on refdes %s: Could not parse symbol file symversion=%s
ru: ВНИМАНИЕ: ошибка разбора версии символа для refdes %s: Невозможно разобрать файл символа symversion=%s

source: WARNING: Symbol version parse error on refdes %s: Could not parse symbol file symversion=
ru: ВНИМАНИЕ: ошибка разбора версии символа для refdes %s: Невозможно разобрать файл символа symversion=

source: WARNING: Symbol version parse error on refdes %s: Could not parse attached symversion=%s
ru: ВНИМАНИЕ: ошибка разбора версии символа для refdes %s: Невозможно разобрать присоединённый symversion=%s

source: WARNING: Symbol version oddity on refdes %s: symversion=%s attached to instantiated symbol, but no symversion= inside symbol file
ru: ВНИМАНИЕ: странная версия символа для поз. обозначения %s: symversion=%s присоединён к используемому символу, но symversion= отсутствует в файле символа

source: WARNING: Symbol version mismatch on refdes %s (%s): Symbol in library is newer than instantiated symbol
ru: ВНИМАНИЕ: версия символа не подходит для поз. обозначения %s (%s): Символ в библиотеке новее чем используемый символ

source: MAJOR VERSION CHANGE (file %.3f, instantiated %.3f, %s)!
ru: ИЗМЕНЁН СТАРШИЙ НОМЕР ВЕРСИИ (файл %.3f, используемый %.3f, %s)!

source: Minor version change (file %.3f, instantiated %.3f)
ru: Изменён младший номер версии (файл %.3f, используемый %.3f)

source: WARNING: Symbol version oddity on refdes %s: Instantiated symbol is newer than symbol in library
ru: ВНИМАНИЕ: странная версия символа для поз. обозначения %s: Используемый символ новее чем символ в библиотеке

source: Component [%s] has been embedded
ru: Компонент [%s] внедрён

source: Could not find component [%s], while trying to unembed. Component is still embedded
ru: Невозможно найти компонент [%s] при исключении. Компонент всё ещё встроен

source: Component [%s] has been successfully unembedded
ru: Компонент [%s] успешно исключён

source: Found a zero length line [ %c %d %d %d %d %d ]
ru: Найдена линия нулевой длины [ %c %d %d %d %d %d ]

source: Found a zero length net [ %c %d %d %d %d %d ]
ru: Найдено соединение нулевой длины [ %c %d %d %d %d %d ]

source: Error reading picture definition line: %s.
ru: Ошибка при чтении строки определения изображения: %s.

source: Found a zero width/height picture [ %c %d %d %d %d ]
ru: Найдено изображение с нулевой шириной/высотой [ %c %d %d %d %d ]

source: Found a picture with a wrong 'mirrored' parameter: %c.
ru: Найдено изображение с ошибочным параметром 'зеркалирование': %c.

source: Setting mirrored to 0
ru: Установка зеркалирования в 0

source: Found a picture with a wrong 'embedded' parameter: %c.
ru: Найдено изображение с ошибочным параметром 'внедрён': %c.

source: Setting embedded to 0
ru: Установка параметра 'внедрён' в 0

source: Found an unsupported picture angle [ %d ]
ru: Найдено изображение с неподдерживаемым углом [ %d ]

source: Setting angle to 0
ru: Установка угла в 0

source: Failed to load image from embedded data [%s]: %s
ru: Невозможно загрузить изображение из встроенных данных [%s]: %s

source: Base64 decoding failed.
ru: Невозможно декодировать base64.

source: Falling back to file loading. Picture unembedded.
ru: Возвращение к загрузке файла. Изображение исключено.

source: Failed to load image from file [%s]: %s
ru: Невозможно загрузить изображение из файла [%s]: %s

source: Loading warning picture.
ru: Загрузка изображения символа предупреждения.

source: Error loading picture from file: %s.
ru: Ошибка при загрузке изображение из файла: %s.

source: ERROR: o_picture_save: unable to encode the picture.
ru: ОШИБКА: o_picture_save: невозможно кодировать изображение.

source: Picture [%s] has been embedded
ru: Изображение [%s] встроено

source: Picture [%s] has been unembedded
ru: Изображение [%s] исключено

source: Found a pin which did not have the whichone field set. Verify and correct manually.
ru: Найден вывод не содержащий установленного поля whichone. Проверьте и вручную исправьте.

source: Found an invalid whichend on a pin (reseting to zero): %d
ru: Найдено неверное соединяемое окончание для вывода (сброс в нуль): %d

source: Found a zero length pin: [ %s ]
ru: Найден вывод нулевой длины: [ %s ]

source: Found a zero size text string [ %c %d %d %d %d %d %d %d %d ]
ru: Найдена текстовая строка нулевого размера [ %c %d %d %d %d %d %d %d %d ]

source: Found an unsupported text angle [ %c %d %d %d %d %d %d %d %d ]
ru: Найден неподдерживаемый угол наклона текста [ %c %d %d %d %d %d %d %d %d ]

source: Found an unsupported text alignment [ %c %d %d %d %d %d %d %d %d ]
ru: Найдено неподдерживаемое выравнивание текста [ %c %d %d %d %d %d %d %d %d ]

source: Setting alignment to LOWER_LEFT
ru: Установка выравнивания в нижнее левое (LOWER_LEFT)

source: Library command failed [%s]: %s
ru: Ошибка при выполнении команды над библиотекой [%s]: %s

source: Library command failed [%s]: Uncaught signal %i.
ru: Ошибка при выполнении команды над библиотекой [%s]: необработанный сигнал %i.

source: Library command failed [%s]
ru: Ошибка при выполнении команды над библиотекой [%s]

source: Error output was: %s
ru: Вывод ошибки: %s

source: Library name [%s] already in use. Using [%s].
ru: Библиотека с именем [%s] уже имеется. Использую [%s].

source: Failed to open directory [%s]: %s
ru: Невозможно открыть каталог [%s]: %s

source: Failed to scan library [%s]: Scheme function returned non-list
ru: Невозможно сканировать библиотеку [%s]: функция Scheme возвратила не список

source: Non-string symbol name while scanning library [%s]
ru: Не текстовый символ в имени при сканировании библиотеки [%s]

source: Cannot add library: name not specified
ru: Невозможно добавить библиотеку: не указано имя

source: Cannot add library [%s]: both 'list' and 'get' commands must be specified.
ru: Невозможно добавить библиотеку [%s]: должны быть указаны команды 'list' и 'get'.

source: Cannot add Scheme-library [%s]: callbacks must be closures
ru: Невозможно добавить Scheme-библиотеку [%s]: функция обратного вызова должна быть замыканием

source: Failed to load symbol from file [%s]: %s
ru: Невозможно загрузить символ из файла [%s]: %s

source: Failed to load symbol data [%s] from source [%s]
ru: Невозможно загрузить данные символа [%s] из файла [%s]

source: Component [%s] was not found in the component library
ru: Компонент [%s] не найден в библиотеке компонентов

source: More than one component found with name [%s]
ru: Найдено более одного компонента с именем [%s]

source: Color index out of range
ru: Цветовой индекс вне диапазона

source: Color map entry must be a two-element list
ru: Элемент карты цветов должен быть списком из двух элементов

source: Index in color map entry must be an integer
ru: Индекс элемента в карте цветов должен быть целым

source: Value in color map entry must be #f or a string
ru: Значение элемента в карте цветов должно быть #f или строка

source: hierarchy loop detected while visiting page: "%s"
ru: обнаружено зацикливание иерархии при переходе к странице: "%s"

source: There are no schematics above the current one!
ru: Нет схем над текущей!

source: ERROR in s_hierarchy_traverse: schematic not found: %s
ru: ОШИБКА в s_hierarchy_traverse: не найдена схема: %s

source: s_page_delete: Can't get the real filename of %s.
ru: s_page_delete: невозможно получить реальное имя файла для %s.

source: s_page_delete: Unable to delete backup file %s.
ru: s_page_delete: невозможно удалить файл резервной копии %s.

source: Saved [%s]
ru: Сохранено [%s]

source: Could NOT save [%s]
ru: Невозможно сохранить [%s]

source: Found [%s]
ru: Найден [%s]

source: Could not find [%s] in any SourceLibrary
ru: Невозможно найти [%s] в исходных библиотеках
